app/controllers/directories_controller.rb

SELECT * FROM `directories` WHERE (`directories`.`id` = 1)
---
  def show
    @directory = Directory.find(params[:id])

SELECT * FROM `directories` WHERE (`directories`.`id` = 1)
SELECT * FROM `archives` WHERE (`archives`.directory_id = 1) LIMIT 1
---
  def edit
    @directory = Directory.find(params[:id])
    if @directory.archives.first.nil?

INSERT INTO `directories` (`name`, `created_at`, `updated_at`, `description`) VALUES('Dowloads', '2009-02-09 21:38:34', '2009-02-09 21:38:34', 'Downloads Nobre Seguradora')
---
  def create
    @directory = Directory.new(params[:directory])

    respond_to do |format|
      if @directory.save

SELECT * FROM `directories` WHERE (`directories`.`id` = 1)
DELETE FROM `archives` WHERE `id` = 1
---
  def update
    params[:archive_ids] ||= []
    @directory = Directory.find(params[:id])
    unless params[:archive_ids].empty?
      Archive.destroy_archives(params[:id], params[:archive_ids])